Revit 2027 API
ElementDesignOptionFilter(ElementId) Constructor
 Constructs a new instance of a filter to match elements contained within a particular design option.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementDesignOptionFilter(
	ElementId designOptionId
)
Public Sub New (
	designOptionId As ElementId
)
public:
ElementDesignOptionFilter(
	ElementId^ designOptionId
)
new :
        designOptionId : ElementId -> ElementDesignOptionFilter
Parameters
designOptionId ElementId
 The design option id to match.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ElementDesignOptionFilter Class
ElementDesignOptionFilter Overload
Autodesk.Revit.DB Namespace